app/Controllers/StockController.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $productosModel = new ProductosModel();
        $productos = $productosModel->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'
---
    public function verDetalle($productoId) {
        $productosModel = new ProductosModel();
        $producto = $productosModel->find($productoId);